keyword_variants = {
'데이트': ['데이트', '소개팅', '연인', '커플', '로맨틱'],
'혼밥': ['혼밥', '혼자', '혼술', '혼자서', '나 혼자'],
'가족식사': ['가족', '아이', '어르신', '부모님', '유아', '아이랑', '아기'],
'노포': ['노포', '오래된', '전통', '30년', '역사', '옛날', '세월'],
'주점': ['주점', '술', '한잔', '소주', '맥주', '포차', '회식', '술집'],
'양식': ['양식', '스테이크', '파스타', '스파게티', '리조또', '피자'],
'일식': ['일식', '스시', '초밥', '라멘', '돈카츠', '돈까스', '우동', '일본'],
'중식': ['중식', '짜장', '짬뽕', '마라', '탕수육', '중국집', '중국식'],
'분식': ['분식', '떡볶이', '김밥', '라면', '튀김', '순대', '오뎅'],
'한식': [
    '한식', '된장찌개', '김치찌개', '불고기', '비빔밥', '국밥', '순대국',
    '갈비탕', '삼겹살', '보쌈', '제육볶음', '백반', '족발', '청국장', '김치전', '전통 한식'
],
'기타': ['퓨전', '인도', '베트남', '타이', '이국적', '에스닉'],

'주차': ['주차', '차 대기', '주차장', '발렛', '파킹'],
'아동편의시설': ['유아', '아이', '아기', '아동', '어린이', '키즈', '유모차'],
'신식/노포': ['신식', '모던', '깔끔한', '노포', '전통', '옛날'],
'규모': ['넓은', '좁은', '작은', '큰', '비좁은', '쾌적한', '혼잡한'],

'예약여부': ['예약', '미리 전화', '예약제', '예약하고', '예약 필수'],
'웨이팅': ['웨이팅', '기다림', '줄서다', '줄섰다', '대기', '줄이 길다'],
'매운정도': ['맵다', '매움', '매워요', '매운맛', '맵긴한데', '얼얼', '매콤'],
'가성비': ['가성비', '가격대비', '저렴', '싸다', '가격 괜찮', '착한 가격', '합리적']
}

# print(keyword_variants.keys())
#<built-in method keys of dict object at 0x0000019B22E1F440>
keywords = ['데이트', '혼밥', '가족식사', '노포', '주점',
            '양식', '일식', '중식', '분식', '한식',
            '기타', '주차', '아동편의시설', '신식', '규모',
            '예약여부', '웨이팅', '매운정도', '가성비'] #19
print(len(keywords))